#include <stdio.h>
#include <math.h>

int main() {
    int x, y;
    double a;

    // Зчитуємо значення x та y
    printf("Введіть значення x: ");
    scanf("%d", &x);
    printf("Введіть значення y: ");
    scanf("%d", &y);

    // Перевірка на допустимість вхідних параметрів
    while (sin(x) + x * y - 2 * x * y == 0) {
        printf("Для заданих значень x та y обчислюваний вираз має невизначений результат. Введіть інші значення.\n");
        printf("Введіть значення x: ");
        scanf("%d", &x);
        printf("Введіть значення y: ");
        scanf("%d", &y);
    }

    // Обчислення значення функції
    a = (x * y + 2 * x - y * x) / (sin(x) + x * y - 2 * x * y);

    // Виведення результату
    printf("Значення функції: %.2f\n", a);

    return 0;
}
